
// 月支与日干（支）的对应关系
// 例如，子月壬日为月德神值时
const DICT = {
  // 月支      子丑寅卯辰巳午未申酉戌亥
  // 吉神
  '月徳':     '壬庚丙甲壬庚丙甲壬庚丙甲',
  '月德合':   '丁乙辛己丁乙辛己丁乙辛己',
  '天德':     '巳庚丁申壬辛亥甲癸寅丙乙',
  '天德合':   '空乙壬空丁丙空己戊空辛庚',
  '五富':     '巳申亥寅巳申亥寅巳申亥寅',
  '六合':     '丑子亥戌酉申未午巳辰卯寅',
  '六仪':     '午巳辰卯寅丑子亥戌酉申未',
  '临日':     '辰酉午亥申丑戌卯子巳寅未', // 正月午日、二月亥日、三月申日、四月丑日等为临日
  '天喜':     '申酉戌亥子丑寅卯辰巳午未',
  '天富':     '寅卯辰巳午未申酉戌亥子丑',
  '月恩':     '甲辛丙丁庚己戊辛壬癸庚乙', // 《五行论》曰：“月恩者，阳建所生之干也，子母相从谓之月恩。其日宜营造，婚姻、移徙，祭祀，上官，纳财。”
  '天成':     '卯巳未酉亥丑卯巳未酉亥丑',
  '天官':     '午申戌子寅辰午申戌子寅辰',
  '天医':     '亥子丑寅卯辰巳午未申酉戌', // 《总要历》曰：“天医者，人之巫医。其日宜请药，避病、寻巫、祷祀。
  '天马':     '寅辰午申戌子寅辰午申戌子',
  '驿马':     '寅亥申巳寅亥申巳寅亥申巳',
  '天财':     '子寅辰午申戌子寅辰午申戌',
  '福生':     '寅申酉卯戌辰亥巳子午丑未',
  '福德':     '寅卯辰巳午未申酉戌亥子丑',
  '天巫':     '寅卯辰巳午未申酉戌亥子丑', // ?同福德
  '地财':     '丑卯巳未酉亥丑卯巳未酉亥',
  '月财':     '酉亥午巳巳未酉亥午巳巳未',
  '月空':     '丙甲壬庚丙甲壬庚丙甲壬庚', // 《天宝历》曰：“月中之阳辰也。所理之日宜设筹谋。陈计策。
  '明星':     '辰午甲戌子寅辰午甲戌子寅',
  '圣心':     '辰戌亥巳子午丑未寅申卯酉',
  '禄库':     '寅卯辰巳午未申酉戌亥子丑', // ?同福德
  '吉庆':     '未子酉寅亥辰丑午卯申巳戌',
  '阴德':     '丑亥酉未巳卯丑亥酉未巳卯',
  '活曜':     '卯申巳戌未子酉寅亥辰丑午',
  '解神':     '午午申申戌戌子子寅寅辰辰',
  '生气':     '戌亥子丑寅卯辰巳午未申酉',
  '普护':     '丑卯申寅酉卯戌辰亥巳子午',
  '益后':     '巳亥子午丑未寅申卯酉辰戌',
  '续世':     '午子丑未寅申卯酉辰戌巳亥',
  '要安':     '未丑寅申卯酉辰戌巳亥午子',
  '天后':     '寅亥申巳寅亥申巳寅亥申巳',
  '天仓':     '辰卯寅丑子亥戌酉申未午巳', // 《总要历》曰:天仓者,天库之神也。其日可以修仓库、受赏赐、纳财、牧养。《历例》曰:天仓者,正月起寅,逆行十二辰。
  '敬安':     '子午未丑申寅酉卯戌辰亥巳',
  '玉宇':     '申寅卯酉辰戌巳亥午子未丑',
  '金堂':     '酉卯辰戌巳亥午子未丑申寅',
  '吉期':     '丑寅卯辰巳午未申酉戌亥子',
  '小时':     '子丑寅卯辰巳午未申酉戌亥',
  '兵福':     '子丑寅卯辰巳午未申酉戌亥', // ?同小时
  '兵宝':     '丑寅卯辰巳午未申酉戌亥子',

  // 凶煞
  '天罡':     '卯戌巳子未寅酉辰亥午丑申',
  '河魁':     '酉辰亥午丑申卯戌巳子未寅',
  '死神':     '卯辰巳午未申酉戌亥子丑寅',
  '死气':     '辰巳午未申酉戌亥子丑寅卯',
  '官符':     '辰巳午未申酉戌亥子丑寅卯', // ?同死气
  '月建':     '子丑寅卯辰巳午未申酉戌亥',
  '月破':     '午未申酉戌亥子丑寅卯辰巳',
  '月煞':     '未辰丑戌未辰丑戌未辰丑戌',
  '月害':     '未午巳辰卯寅丑子亥戌酉申',
  '月刑':     '卯戌巳子辰申午丑寅酉未亥',
  '月厌':     '子亥戌酉申未午巳辰卯寅丑',
  '月虚':     '未辰丑戌未辰丑戌未辰丑戌',
  '灾煞':     '午卯子酉午卯子酉午卯子酉',
  '劫煞':     '巳寅亥申巳寅亥申巳寅亥申',
  '厌对':     '午巳辰卯寅丑子亥戌酉申未',
  '招摇':     '午巳辰卯寅丑子亥戌酉申未',
  '小红砂':   '酉丑巳酉丑巳酉丑巳酉丑巳',
  '人隔':     '丑亥酉未巳卯丑亥酉未巳卯',
  '往亡':     '戌丑寅巳申亥卯午酉子辰未',
  '重丧':     '癸己甲乙己丙丁己庚辛己壬',
  '重复':     '癸己庚辛己壬癸戊甲乙己壬',
  '神号':     '申酉戌亥子丑寅卯辰巳午未',
  '妨择':     '辰辰午午申申戌戌子子寅寅',
  '披麻':     '午卯子酉午卯子酉午卯子酉',
  // '冰消瓦陷': '酉辰巳子丑申卯戌亥午未寅',
  '大耗':     '辰巳午未申酉戌亥子丑寅卯',
  '天吏':     '卯子酉午卯子酉午卯子酉午',
  '天瘟':     '丑卯未戌辰寅午子酉申巳亥',
  '天狱':     '午酉子卯午酉子卯午酉子卯',
  '天火':     '午酉子卯午酉子卯午酉子卯',
  '天棒':     '寅辰午申戌子寅辰午申戌子',
  '天狗':     '寅卯辰巳午未申酉戌亥子丑',
  '天狗下食':  '戌亥子丑寅卯辰巳午未申酉',
  '天贼':     '卯寅丑子亥戌酉申未午巳辰',
  '地火':     '子亥戌酉申未午巳辰卯寅丑',
  '独火':     '未午巳辰卯寅丑子亥戌酉申',
  '受死':     '卯酉戌辰亥巳子午丑未寅申',
  '黄沙':     '寅子午寅子午寅子午寅子午',
  '六不成':   '卯未寅午戌巳酉丑申子辰亥',
  '小耗':     '卯辰巳午未申酉戌亥子丑寅',
  '神隔':     '酉未巳卯丑亥酉未巳卯丑亥',
  '朱雀':     '亥丑卯巳未酉亥丑卯巳未酉',
  '白虎':     '寅辰午申戌子寅辰午申戌子',
  '玄武':     '巳未酉亥丑卯巳未酉亥丑卯',
  '勾陈':     '未酉亥丑卯巳未酉亥丑卯巳',
  '木马':     '辰午巳未酉申戌子亥丑卯寅',
  '破败':     '辰午申戌子寅辰午申戌子寅',
  '殃败':     '巳辰卯寅丑子亥戌酉申未午',
  '雷公':     '巳申寅亥巳申寅亥巳申寅亥',
  '飞廉':     '申酉戌巳午未寅卯辰亥子丑', // 《神枢经》曰：“飞廉者，岁之廉察使君之象，亦名大煞。所理之不可兴工、动土，搬移，嫁娶《广圣历》曰：“子年在申，丑年在酉，寅年在戌，卯年在巳，辰年在午，巳年在未，午年在寅，未年在卯，申 年在辰，酉年在亥，戌年在子，亥年在丑也。”
  '大煞':     '申酉戌巳午未寅卯辰亥子丑', // ?同飞廉
  '枯鱼':     '申巳辰丑戌未卯子酉午寅亥',
  '九空':     '申巳辰丑戌未卯子酉午寅亥',
  '八座':     '酉戌亥子丑寅卯辰巳午未申',
  '血忌':     '午子丑未寅申卯酉辰戌巳亥',
  '四击':     '未未戌戌戌丑丑丑辰辰辰未', // 四击者,春戌、夏丑、秋辰、冬未。按四击者,四时所冲之墓辰也。如正二三月建寅卯辰,辰与戌冲,故戌为四击也。馀仿此。
  '五鬼':     '未戌午寅辰酉卯申丑巳子亥',
  '九坎':     '申巳辰丑戌未卯子酉午寅亥', // 《广圣历》曰:九坎者,月中杀神也。其日忌乘船渡水、修堤防、筑垣墙、苫盖屋舍。《历例》曰:九坎者,正月在辰逆行四季,五月在卯逆行四仲,九月在寅逆行四孟。
  '九焦':     '申巳辰丑戌未卯子酉午寅亥', // 《广圣历》曰:九焦者,月中杀神也。其日忌炉冶、铸造、种植、修筑园圃。《历例》曰:正月在辰逆行四季,五月在卯逆行四仲,九月在寅逆行四孟。
  '蚩尤':     '戌子寅辰午申戌子寅辰午申', // 正七逢寅二八辰，三九午上四十申。五十一月原在戌，六十二月子为真。
  '大时':     '酉午卯子酉午卯子酉午卯子', // 《神枢经》曰:大时者,将军之象也。所直之日,忌出军攻战、筑室会亲。李鼎祚曰:大时者,正月起卯逆行四仲。
  '大败':     '酉午卯子酉午卯子酉午卯子', // 十恶大败干支纪日分别为：甲辰、乙巳、丙申、丁亥、戊戌、己丑、庚辰、辛巳、壬申、癸亥。（不确定）《总要历》曰:大败者,兵败忌辰也。其日忌临阵侵敌、攻城野战。《历例》曰:正月起卯,逆行四仲。
  '咸池':     '酉午卯子酉午卯子酉午卯子',
  '土符':     '申子丑巳酉寅午戌卯未亥辰', // 《历例》曰:士符者,正月丑，二月已,三月酉,四月寅,五月午,六月戌,七月卯,八月未,九月亥,十月辰,十一月申,十二月子。
  '土府':     '子丑寅卯辰巳午未申酉戌亥',
  '血支':     '亥子丑寅卯辰巳午未申酉戌',
  '游祸':     '亥申巳寅亥申巳寅亥申巳寅',
  '归忌':     '寅子丑寅子丑寅子丑寅子丑', // 《广圣历》:归忌者,月内凶神也。其日忌远行、归家移徙、娶归、《历例》曰:孟月丑,仲月寅,季月子
  '复日':     '癸巳甲乙戊丙丁巳庚辛戊壬', // 《天宝历》曰:复日者,为魁罡所系之辰也。其日忌为凶事,利为吉事。《历例》曰:复日者,正、七月甲庚,二、八月乙辛,四十月丙壬,五、十一月丁癸,三、九、六、十二月戊巳日也。
};

export default (yueZhi, riGanZhi) => {
  const yueZhiIndex = '子丑寅卯辰巳午未申酉戌亥'.indexOf(yueZhi);

  const res = [];
  Object.entries(DICT).map(([name, dict]) => {
    if (riGanZhi.includes(dict[yueZhiIndex])) {
      res.push(name);
    }
  });
  return res;
}